// Задача 2:Задайте строку, содержащую латинские буквы в обоих регистрах.
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string str = "Hello!";
System.Console.WriteLine(str);

string strNew = str.ToLower();
System.Console.WriteLine(strNew);
